Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/pwm.h
/* -------- PWM_FMR : (PWM Offset: 0x5C) (R/W 32) PWM Fault Mode Register -------- */
#define PWM_FMR_FPOL_Pos                      _UINT32_(0)                                          /* (PWM_FMR) Fault Polarity Position */
#define PWM_FMR_FPOL_Msk                      (_UINT32_(0xFF) << PWM_FMR_FPOL_Pos)                 /* (PWM_FMR) Fault Polarity Mask */
#define PWM_FMR_FPOL(value)                   (PWM_FMR_FPOL_Msk & (_UINT32_(value) << PWM_FMR_FPOL_Pos)) /* Assigment of value for FPOL in the PWM_FMR register */
#define PWM_FMR_FMOD_Pos                      _UINT32_(8)                                          /* (PWM_FMR) Fault Activation Mode Position */
#define PWM_FMR_FMOD_Msk                      (_UINT32_(0xFF) << PWM_FMR_FMOD_Pos)                 /* (PWM_FMR) Fault Activation Mode Mask */
#define PWM_FMR_FMOD(value)                   (PWM_FMR_FMOD_Msk & (_UINT32_(value) << PWM_FMR_FMOD_Pos)) /* Assigment of value for FMOD in the PWM_FMR register */
#define PWM_FMR_FFIL_Pos                      _UINT32_(16)                                         /* (PWM_FMR) Fault Filtering Position */
#define PWM_FMR_FFIL_Msk                      (_UINT32_(0xFF) << PWM_FMR_FFIL_Pos)                 /* (PWM_FMR) Fault Filtering Mask */
#define PWM_FMR_FFIL(value)                   (PWM_FMR_FFIL_Msk & (_UINT32_(value) << PWM_FMR_FFIL_Pos)) /* Assigment of value for FFIL in the PWM_FMR register */
#define PWM_FMR_Msk                           _UINT32_(0x00FFFFFF)                                 /* (PWM_FMR) Register Mask  */


/* -------- PWM_FSR : (PWM Offset: 0x60) ( R/ 32) PWM Fault Status Register -------- */
#define PWM_FSR_FIV_Pos                       _UINT32_(0)                                          /* (PWM_FSR) Fault Input Value Position */
#define PWM_FSR_FIV_Msk                       (_UINT32_(0xFF) << PWM_FSR_FIV_Pos)                  /* (PWM_FSR) Fault Input Value Mask */
#define PWM_FSR_FIV(value)                    (PWM_FSR_FIV_Msk & (_UINT32_(value) << PWM_FSR_FIV_Pos)) /* Assigment of value for FIV in the PWM_FSR register */
#define PWM_FSR_FS_Pos                        _UINT32_(8)                                          /* (PWM_FSR) Fault Status Position */
#define PWM_FSR_FS_Msk                        (_UINT32_(0xFF) << PWM_FSR_FS_Pos)                   /* (PWM_FSR) Fault Status Mask */
#define PWM_FSR_FS(value)                     (PWM_FSR_FS_Msk & (_UINT32_(value) << PWM_FSR_FS_Pos)) /* Assigment of value for FS in the PWM_FSR register */
#define PWM_FSR_Msk                           _UINT32_(0x0000FFFF)                                 /* (PWM_FSR) Register Mask  */


/* -------- PWM_FCR : (PWM Offset: 0x64) ( /W 32) PWM Fault Clear Register -------- */
#define PWM_FCR_FCLR_Pos                      _UINT32_(0)                                          /* (PWM_FCR) Fault Clear Position */
#define PWM_FCR_FCLR_Msk                      (_UINT32_(0xFF) << PWM_FCR_FCLR_Pos)                 /* (PWM_FCR) Fault Clear Mask */
#define PWM_FCR_FCLR(value)                   (PWM_FCR_FCLR_Msk & (_UINT32_(value) << PWM_FCR_FCLR_Pos)) /* Assigment of value for FCLR in the PWM_FCR register */
#define PWM_FCR_Msk                           _UINT32_(0x000000FF)                                 /* (PWM_FCR) Register Mask  */


/* -------- PWM_FPV1 : (PWM Offset: 0x68) (R/W 32) PWM Fault Protection Value Register 1 -------- */
#define PWM_FPV1_FPVH0_Pos                    _UINT32_(0)                                          /* (PWM_FPV1) Fault Protection Value for PWMH output on channel 0 Position */
#define PWM_FPV1_FPVH0_Msk                    (_UINT32_(0x1) << PWM_FPV1_FPVH0_Pos)                /* (PWM_FPV1) Fault Protection Value for PWMH output on channel 0 Mask */
#define PWM_FPV1_FPVH0(value)                 (PWM_FPV1_FPVH0_Msk & (_UINT32_(value) << PWM_FPV1_FPVH0_Pos)) /* Assigment of value for FPVH0 in the PWM_FPV1 register */
#define PWM_FPV1_FPVH1_Pos                    _UINT32_(1)                                          /* (PWM_FPV1) Fault Protection Value for PWMH output on channel 1 Position */
#define PWM_FPV1_FPVH1_Msk                    (_UINT32_(0x1) << PWM_FPV1_FPVH1_Pos)                /* (PWM_FPV1) Fault Protection Value for PWMH output on channel 1 Mask */
#define PWM_FPV1_FPVH1(value)                 (PWM_FPV1_FPVH1_Msk & (_UINT32_(value) << PWM_FPV1_FPVH1_Pos)) /* Assigment of value for FPVH1 in the PWM_FPV1 register */
#define PWM_FPV1_FPVH2_Pos                    _UINT32_(2)                                          /* (PWM_FPV1) Fault Protection Value for PWMH output on channel 2 Position */
#define PWM_FPV1_FPVH2_Msk                    (_UINT32_(0x1) << PWM_FPV1_FPVH2_Pos)                /* (PWM_FPV1) Fault Protection Value for PWMH output on channel 2 Mask */
#define PWM_FPV1_FPVH2(value)                 (PWM_FPV1_FPVH2_Msk & (_UINT32_(value) << PWM_FPV1_FPVH2_Pos)) /* Assigment of value for FPVH2 in the PWM_FPV1 register */
#define PWM_FPV1_FPVH3_Pos                    _UINT32_(3)                                          /* (PWM_FPV1) Fault Protection Value for PWMH output on channel 3 Position */
#define PWM_FPV1_FPVH3_Msk                    (_UINT32_(0x1) << PWM_FPV1_FPVH3_Pos)                /* (PWM_FPV1) Fault Protection Value for PWMH output on channel 3 Mask */
#define PWM_FPV1_FPVH3(value)                 (PWM_FPV1_FPVH3_Msk & (_UINT32_(value) << PWM_FPV1_FPVH3_Pos)) /* Assigment of value for FPVH3 in the PWM_FPV1 register */
#define PWM_FPV1_FPVL0_Pos                    _UINT32_(16)                                         /* (PWM_FPV1) Fault Protection Value for PWML output on channel 0 Position */
#define PWM_FPV1_FPVL0_Msk                    (_UINT32_(0x1) << PWM_FPV1_FPVL0_Pos)                /* (PWM_FPV1) Fault Protection Value for PWML output on channel 0 Mask */
#define PWM_FPV1_FPVL0(value)                 (PWM_FPV1_FPVL0_Msk & (_UINT32_(value) << PWM_FPV1_FPVL0_Pos)) /* Assigment of value for FPVL0 in the PWM_FPV1 register */
#define PWM_FPV1_FPVL1_Pos                    _UINT32_(17)                                         /* (PWM_FPV1) Fault Protection Value for PWML output on channel 1 Position */
#define PWM_FPV1_FPVL1_Msk                    (_UINT32_(0x1) << PWM_FPV1_FPVL1_Pos)                /* (PWM_FPV1) Fault Protection Value for PWML output on channel 1 Mask */
#define PWM_FPV1_FPVL1(value)                 (PWM_FPV1_FPVL1_Msk & (_UINT32_(value) << PWM_FPV1_FPVL1_Pos)) /* Assigment of value for FPVL1 in the PWM_FPV1 register */
#define PWM_FPV1_FPVL2_Pos                    _UINT32_(18)                                         /* (PWM_FPV1) Fault Protection Value for PWML output on channel 2 Position */
#define PWM_FPV1_FPVL2_Msk                    (_UINT32_(0x1) << PWM_FPV1_FPVL2_Pos)                /* (PWM_FPV1) Fault Protection Value for PWML output on channel 2 Mask */
#define PWM_FPV1_FPVL2(value)                 (PWM_FPV1_FPVL2_Msk & (_UINT32_(value) << PWM_FPV1_FPVL2_Pos)) /* Assigment of value for FPVL2 in the PWM_FPV1 register */
#define PWM_FPV1_FPVL3_Pos                    _UINT32_(19)                                         /* (PWM_FPV1) Fault Protection Value for PWML output on channel 3 Position */
#define PWM_FPV1_FPVL3_Msk                    (_UINT32_(0x1) << PWM_FPV1_FPVL3_Pos)                /* (PWM_FPV1) Fault Protection Value for PWML output on channel 3 Mask */
#define PWM_FPV1_FPVL3(value)                 (PWM_FPV1_FPVL3_Msk & (_UINT32_(value) << PWM_FPV1_FPVL3_Pos)) /* Assigment of value for FPVL3 in the PWM_FPV1 register */
#define PWM_FPV1_Msk                          _UINT32_(0x000F000F)                                 /* (PWM_FPV1) Register Mask  */

