Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/pwm.h
#define PWM_FPV1_FPVH_Pos                     _UINT32_(0)                                          /* (PWM_FPV1 Position) Fault Protection Value for PWMH output on channel x */
#define PWM_FPV1_FPVH_Msk                     (_UINT32_(0xF) << PWM_FPV1_FPVH_Pos)                 /* (PWM_FPV1 Mask) FPVH */
#define PWM_FPV1_FPVH(value)                  (PWM_FPV1_FPVH_Msk & (_UINT32_(value) << PWM_FPV1_FPVH_Pos)) 
#define PWM_FPV1_FPVL_Pos                     _UINT32_(16)                                         /* (PWM_FPV1 Position) Fault Protection Value for PWML output on channel 3 */
#define PWM_FPV1_FPVL_Msk                     (_UINT32_(0xF) << PWM_FPV1_FPVL_Pos)                 /* (PWM_FPV1 Mask) FPVL */
#define PWM_FPV1_FPVL(value)                  (PWM_FPV1_FPVL_Msk & (_UINT32_(value) << PWM_FPV1_FPVL_Pos)) 

/* -------- PWM_FPE : (PWM Offset: 0x6C) (R/W 32) PWM Fault Protection Enable Register -------- */
#define PWM_FPE_FPE0_Pos                      _UINT32_(0)                                          /* (PWM_FPE) Fault Protection Enable for channel 0 Position */
#define PWM_FPE_FPE0_Msk                      (_UINT32_(0xFF) << PWM_FPE_FPE0_Pos)                 /* (PWM_FPE) Fault Protection Enable for channel 0 Mask */
#define PWM_FPE_FPE0(value)                   (PWM_FPE_FPE0_Msk & (_UINT32_(value) << PWM_FPE_FPE0_Pos)) /* Assigment of value for FPE0 in the PWM_FPE register */
#define PWM_FPE_FPE1_Pos                      _UINT32_(8)                                          /* (PWM_FPE) Fault Protection Enable for channel 1 Position */
#define PWM_FPE_FPE1_Msk                      (_UINT32_(0xFF) << PWM_FPE_FPE1_Pos)                 /* (PWM_FPE) Fault Protection Enable for channel 1 Mask */
#define PWM_FPE_FPE1(value)                   (PWM_FPE_FPE1_Msk & (_UINT32_(value) << PWM_FPE_FPE1_Pos)) /* Assigment of value for FPE1 in the PWM_FPE register */
#define PWM_FPE_FPE2_Pos                      _UINT32_(16)                                         /* (PWM_FPE) Fault Protection Enable for channel 2 Position */
#define PWM_FPE_FPE2_Msk                      (_UINT32_(0xFF) << PWM_FPE_FPE2_Pos)                 /* (PWM_FPE) Fault Protection Enable for channel 2 Mask */
#define PWM_FPE_FPE2(value)                   (PWM_FPE_FPE2_Msk & (_UINT32_(value) << PWM_FPE_FPE2_Pos)) /* Assigment of value for FPE2 in the PWM_FPE register */
#define PWM_FPE_FPE3_Pos                      _UINT32_(24)                                         /* (PWM_FPE) Fault Protection Enable for channel 3 Position */
#define PWM_FPE_FPE3_Msk                      (_UINT32_(0xFF) << PWM_FPE_FPE3_Pos)                 /* (PWM_FPE) Fault Protection Enable for channel 3 Mask */
#define PWM_FPE_FPE3(value)                   (PWM_FPE_FPE3_Msk & (_UINT32_(value) << PWM_FPE_FPE3_Pos)) /* Assigment of value for FPE3 in the PWM_FPE register */
#define PWM_FPE_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (PWM_FPE) Register Mask  */


/* -------- PWM_ELMR : (PWM Offset: 0x7C) (R/W 32) PWM Event Line 0 Mode Register 0 -------- */
#define PWM_ELMR_CSEL0_Pos                    _UINT32_(0)                                          /* (PWM_ELMR) Comparison 0 Selection Position */
#define PWM_ELMR_CSEL0_Msk                    (_UINT32_(0x1) << PWM_ELMR_CSEL0_Pos)                /* (PWM_ELMR) Comparison 0 Selection Mask */
#define PWM_ELMR_CSEL0(value)                 (PWM_ELMR_CSEL0_Msk & (_UINT32_(value) << PWM_ELMR_CSEL0_Pos)) /* Assigment of value for CSEL0 in the PWM_ELMR register */
#define PWM_ELMR_CSEL1_Pos                    _UINT32_(1)                                          /* (PWM_ELMR) Comparison 1 Selection Position */
#define PWM_ELMR_CSEL1_Msk                    (_UINT32_(0x1) << PWM_ELMR_CSEL1_Pos)                /* (PWM_ELMR) Comparison 1 Selection Mask */
#define PWM_ELMR_CSEL1(value)                 (PWM_ELMR_CSEL1_Msk & (_UINT32_(value) << PWM_ELMR_CSEL1_Pos)) /* Assigment of value for CSEL1 in the PWM_ELMR register */
#define PWM_ELMR_CSEL2_Pos                    _UINT32_(2)                                          /* (PWM_ELMR) Comparison 2 Selection Position */
#define PWM_ELMR_CSEL2_Msk                    (_UINT32_(0x1) << PWM_ELMR_CSEL2_Pos)                /* (PWM_ELMR) Comparison 2 Selection Mask */
#define PWM_ELMR_CSEL2(value)                 (PWM_ELMR_CSEL2_Msk & (_UINT32_(value) << PWM_ELMR_CSEL2_Pos)) /* Assigment of value for CSEL2 in the PWM_ELMR register */
#define PWM_ELMR_CSEL3_Pos                    _UINT32_(3)                                          /* (PWM_ELMR) Comparison 3 Selection Position */
#define PWM_ELMR_CSEL3_Msk                    (_UINT32_(0x1) << PWM_ELMR_CSEL3_Pos)                /* (PWM_ELMR) Comparison 3 Selection Mask */
#define PWM_ELMR_CSEL3(value)                 (PWM_ELMR_CSEL3_Msk & (_UINT32_(value) << PWM_ELMR_CSEL3_Pos)) /* Assigment of value for CSEL3 in the PWM_ELMR register */
#define PWM_ELMR_CSEL4_Pos                    _UINT32_(4)                                          /* (PWM_ELMR) Comparison 4 Selection Position */
#define PWM_ELMR_CSEL4_Msk                    (_UINT32_(0x1) << PWM_ELMR_CSEL4_Pos)                /* (PWM_ELMR) Comparison 4 Selection Mask */
#define PWM_ELMR_CSEL4(value)                 (PWM_ELMR_CSEL4_Msk & (_UINT32_(value) << PWM_ELMR_CSEL4_Pos)) /* Assigment of value for CSEL4 in the PWM_ELMR register */
#define PWM_ELMR_CSEL5_Pos                    _UINT32_(5)                                          /* (PWM_ELMR) Comparison 5 Selection Position */
#define PWM_ELMR_CSEL5_Msk                    (_UINT32_(0x1) << PWM_ELMR_CSEL5_Pos)                /* (PWM_ELMR) Comparison 5 Selection Mask */
#define PWM_ELMR_CSEL5(value)                 (PWM_ELMR_CSEL5_Msk & (_UINT32_(value) << PWM_ELMR_CSEL5_Pos)) /* Assigment of value for CSEL5 in the PWM_ELMR register */
#define PWM_ELMR_CSEL6_Pos                    _UINT32_(6)                                          /* (PWM_ELMR) Comparison 6 Selection Position */
#define PWM_ELMR_CSEL6_Msk                    (_UINT32_(0x1) << PWM_ELMR_CSEL6_Pos)                /* (PWM_ELMR) Comparison 6 Selection Mask */
#define PWM_ELMR_CSEL6(value)                 (PWM_ELMR_CSEL6_Msk & (_UINT32_(value) << PWM_ELMR_CSEL6_Pos)) /* Assigment of value for CSEL6 in the PWM_ELMR register */
#define PWM_ELMR_CSEL7_Pos                    _UINT32_(7)                                          /* (PWM_ELMR) Comparison 7 Selection Position */
#define PWM_ELMR_CSEL7_Msk                    (_UINT32_(0x1) << PWM_ELMR_CSEL7_Pos)                /* (PWM_ELMR) Comparison 7 Selection Mask */
#define PWM_ELMR_CSEL7(value)                 (PWM_ELMR_CSEL7_Msk & (_UINT32_(value) << PWM_ELMR_CSEL7_Pos)) /* Assigment of value for CSEL7 in the PWM_ELMR register */
#define PWM_ELMR_Msk                          _UINT32_(0x000000FF)                                 /* (PWM_ELMR) Register Mask  */

#define PWM_ELMR_CSEL_Pos                     _UINT32_(0)                                          /* (PWM_ELMR Position) Comparison 7 Selection */
#define PWM_ELMR_CSEL_Msk                     (_UINT32_(0xFF) << PWM_ELMR_CSEL_Pos)                /* (PWM_ELMR Mask) CSEL */
#define PWM_ELMR_CSEL(value)                  (PWM_ELMR_CSEL_Msk & (_UINT32_(value) << PWM_ELMR_CSEL_Pos)) 

/* -------- PWM_SSPR : (PWM Offset: 0xA0) (R/W 32) PWM Spread Spectrum Register -------- */
#define PWM_SSPR_SPRD_Pos                     _UINT32_(0)                                          /* (PWM_SSPR) Spread Spectrum Limit Value Position */
#define PWM_SSPR_SPRD_Msk                     (_UINT32_(0xFFFFFF) << PWM_SSPR_SPRD_Pos)            /* (PWM_SSPR) Spread Spectrum Limit Value Mask */
#define PWM_SSPR_SPRD(value)                  (PWM_SSPR_SPRD_Msk & (_UINT32_(value) << PWM_SSPR_SPRD_Pos)) /* Assigment of value for SPRD in the PWM_SSPR register */
#define PWM_SSPR_SPRDM_Pos                    _UINT32_(24)                                         /* (PWM_SSPR) Spread Spectrum Counter Mode Position */
#define PWM_SSPR_SPRDM_Msk                    (_UINT32_(0x1) << PWM_SSPR_SPRDM_Pos)                /* (PWM_SSPR) Spread Spectrum Counter Mode Mask */
#define PWM_SSPR_SPRDM(value)                 (PWM_SSPR_SPRDM_Msk & (_UINT32_(value) << PWM_SSPR_SPRDM_Pos)) /* Assigment of value for SPRDM in the PWM_SSPR register */
#define PWM_SSPR_Msk                          _UINT32_(0x01FFFFFF)                                 /* (PWM_SSPR) Register Mask  */


