Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/pwm.h
/* -------- PWM_CMUPD2 : (PWM Offset: 0x440) ( /W 32) PWM Channel Mode Update Register (ch_num = 2) -------- */
#define PWM_CMUPD2_CPOLUP_Pos                 _UINT32_(9)                                          /* (PWM_CMUPD2) Channel Polarity Update Position */
#define PWM_CMUPD2_CPOLUP_Msk                 (_UINT32_(0x1) << PWM_CMUPD2_CPOLUP_Pos)             /* (PWM_CMUPD2) Channel Polarity Update Mask */
#define PWM_CMUPD2_CPOLUP(value)              (PWM_CMUPD2_CPOLUP_Msk & (_UINT32_(value) << PWM_CMUPD2_CPOLUP_Pos)) /* Assigment of value for CPOLUP in the PWM_CMUPD2 register */
#define PWM_CMUPD2_CPOLINVUP_Pos              _UINT32_(13)                                         /* (PWM_CMUPD2) Channel Polarity Inversion Update Position */
#define PWM_CMUPD2_CPOLINVUP_Msk              (_UINT32_(0x1) << PWM_CMUPD2_CPOLINVUP_Pos)          /* (PWM_CMUPD2) Channel Polarity Inversion Update Mask */
#define PWM_CMUPD2_CPOLINVUP(value)           (PWM_CMUPD2_CPOLINVUP_Msk & (_UINT32_(value) << PWM_CMUPD2_CPOLINVUP_Pos)) /* Assigment of value for CPOLINVUP in the PWM_CMUPD2 register */
#define PWM_CMUPD2_Msk                        _UINT32_(0x00002200)                                 /* (PWM_CMUPD2) Register Mask  */


/* -------- PWM_ETRG2 : (PWM Offset: 0x44C) (R/W 32) PWM External Trigger Register (trg_num = 2) -------- */
#define PWM_ETRG2_MAXCNT_Pos                  _UINT32_(0)                                          /* (PWM_ETRG2) Maximum Counter value Position */
#define PWM_ETRG2_MAXCNT_Msk                  (_UINT32_(0xFFFFFF) << PWM_ETRG2_MAXCNT_Pos)         /* (PWM_ETRG2) Maximum Counter value Mask */
#define PWM_ETRG2_MAXCNT(value)               (PWM_ETRG2_MAXCNT_Msk & (_UINT32_(value) << PWM_ETRG2_MAXCNT_Pos)) /* Assigment of value for MAXCNT in the PWM_ETRG2 register */
#define PWM_ETRG2_TRGMODE_Pos                 _UINT32_(24)                                         /* (PWM_ETRG2) External Trigger Mode Position */
#define PWM_ETRG2_TRGMODE_Msk                 (_UINT32_(0x3) << PWM_ETRG2_TRGMODE_Pos)             /* (PWM_ETRG2) External Trigger Mode Mask */
#define PWM_ETRG2_TRGMODE(value)              (PWM_ETRG2_TRGMODE_Msk & (_UINT32_(value) << PWM_ETRG2_TRGMODE_Pos)) /* Assigment of value for TRGMODE in the PWM_ETRG2 register */
#define   PWM_ETRG2_TRGMODE_OFF_Val           _UINT32_(0x0)                                        /* (PWM_ETRG2) External trigger is not enabled.  */
#define   PWM_ETRG2_TRGMODE_MODE1_Val         _UINT32_(0x1)                                        /* (PWM_ETRG2) External PWM Reset Mode  */
#define   PWM_ETRG2_TRGMODE_MODE2_Val         _UINT32_(0x2)                                        /* (PWM_ETRG2) External PWM Start Mode  */
#define   PWM_ETRG2_TRGMODE_MODE3_Val         _UINT32_(0x3)                                        /* (PWM_ETRG2) Cycle-by-cycle Duty Mode  */
#define PWM_ETRG2_TRGMODE_OFF                 (PWM_ETRG2_TRGMODE_OFF_Val << PWM_ETRG2_TRGMODE_Pos) /* (PWM_ETRG2) External trigger is not enabled. Position  */
#define PWM_ETRG2_TRGMODE_MODE1               (PWM_ETRG2_TRGMODE_MODE1_Val << PWM_ETRG2_TRGMODE_Pos) /* (PWM_ETRG2) External PWM Reset Mode Position  */
#define PWM_ETRG2_TRGMODE_MODE2               (PWM_ETRG2_TRGMODE_MODE2_Val << PWM_ETRG2_TRGMODE_Pos) /* (PWM_ETRG2) External PWM Start Mode Position  */
#define PWM_ETRG2_TRGMODE_MODE3               (PWM_ETRG2_TRGMODE_MODE3_Val << PWM_ETRG2_TRGMODE_Pos) /* (PWM_ETRG2) Cycle-by-cycle Duty Mode Position  */
#define PWM_ETRG2_TRGEDGE_Pos                 _UINT32_(28)                                         /* (PWM_ETRG2) Edge Selection Position */
#define PWM_ETRG2_TRGEDGE_Msk                 (_UINT32_(0x1) << PWM_ETRG2_TRGEDGE_Pos)             /* (PWM_ETRG2) Edge Selection Mask */
#define PWM_ETRG2_TRGEDGE(value)              (PWM_ETRG2_TRGEDGE_Msk & (_UINT32_(value) << PWM_ETRG2_TRGEDGE_Pos)) /* Assigment of value for TRGEDGE in the PWM_ETRG2 register */
#define   PWM_ETRG2_TRGEDGE_FALLING_ZERO_Val  _UINT32_(0x0)                                        /* (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0  */
#define   PWM_ETRG2_TRGEDGE_RISING_ONE_Val    _UINT32_(0x1)                                        /* (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1  */
#define PWM_ETRG2_TRGEDGE_FALLING_ZERO        (PWM_ETRG2_TRGEDGE_FALLING_ZERO_Val << PWM_ETRG2_TRGEDGE_Pos) /* (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0 Position  */
#define PWM_ETRG2_TRGEDGE_RISING_ONE          (PWM_ETRG2_TRGEDGE_RISING_ONE_Val << PWM_ETRG2_TRGEDGE_Pos) /* (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1 Position  */
#define PWM_ETRG2_TRGFILT_Pos                 _UINT32_(29)                                         /* (PWM_ETRG2) Filtered input Position */
#define PWM_ETRG2_TRGFILT_Msk                 (_UINT32_(0x1) << PWM_ETRG2_TRGFILT_Pos)             /* (PWM_ETRG2) Filtered input Mask */
#define PWM_ETRG2_TRGFILT(value)              (PWM_ETRG2_TRGFILT_Msk & (_UINT32_(value) << PWM_ETRG2_TRGFILT_Pos)) /* Assigment of value for TRGFILT in the PWM_ETRG2 register */
#define PWM_ETRG2_TRGSRC_Pos                  _UINT32_(30)                                         /* (PWM_ETRG2) Trigger Source Position */
#define PWM_ETRG2_TRGSRC_Msk                  (_UINT32_(0x1) << PWM_ETRG2_TRGSRC_Pos)              /* (PWM_ETRG2) Trigger Source Mask */
#define PWM_ETRG2_TRGSRC(value)               (PWM_ETRG2_TRGSRC_Msk & (_UINT32_(value) << PWM_ETRG2_TRGSRC_Pos)) /* Assigment of value for TRGSRC in the PWM_ETRG2 register */
#define PWM_ETRG2_RFEN_Pos                    _UINT32_(31)                                         /* (PWM_ETRG2) Recoverable Fault Enable Position */
#define PWM_ETRG2_RFEN_Msk                    (_UINT32_(0x1) << PWM_ETRG2_RFEN_Pos)                /* (PWM_ETRG2) Recoverable Fault Enable Mask */
#define PWM_ETRG2_RFEN(value)                 (PWM_ETRG2_RFEN_Msk & (_UINT32_(value) << PWM_ETRG2_RFEN_Pos)) /* Assigment of value for RFEN in the PWM_ETRG2 register */
#define PWM_ETRG2_Msk                         _UINT32_(0xF3FFFFFF)                                 /* (PWM_ETRG2) Register Mask  */


/* -------- PWM_LEBR2 : (PWM Offset: 0x450) (R/W 32) PWM Leading-Edge Blanking Register (trg_num = 2) -------- */
#define PWM_LEBR2_LEBDELAY_Pos                _UINT32_(0)                                          /* (PWM_LEBR2) Leading-Edge Blanking Delay for TRGINx Position */
#define PWM_LEBR2_LEBDELAY_Msk                (_UINT32_(0x7F) << PWM_LEBR2_LEBDELAY_Pos)           /* (PWM_LEBR2) Leading-Edge Blanking Delay for TRGINx Mask */
#define PWM_LEBR2_LEBDELAY(value)             (PWM_LEBR2_LEBDELAY_Msk & (_UINT32_(value) << PWM_LEBR2_LEBDELAY_Pos)) /* Assigment of value for LEBDELAY in the PWM_LEBR2 register */
#define PWM_LEBR2_PWMLFEN_Pos                 _UINT32_(16)                                         /* (PWM_LEBR2) PWML Falling Edge Enable Position */
#define PWM_LEBR2_PWMLFEN_Msk                 (_UINT32_(0x1) << PWM_LEBR2_PWMLFEN_Pos)             /* (PWM_LEBR2) PWML Falling Edge Enable Mask */
#define PWM_LEBR2_PWMLFEN(value)              (PWM_LEBR2_PWMLFEN_Msk & (_UINT32_(value) << PWM_LEBR2_PWMLFEN_Pos)) /* Assigment of value for PWMLFEN in the PWM_LEBR2 register */
#define PWM_LEBR2_PWMLREN_Pos                 _UINT32_(17)                                         /* (PWM_LEBR2) PWML Rising Edge Enable Position */
#define PWM_LEBR2_PWMLREN_Msk                 (_UINT32_(0x1) << PWM_LEBR2_PWMLREN_Pos)             /* (PWM_LEBR2) PWML Rising Edge Enable Mask */
#define PWM_LEBR2_PWMLREN(value)              (PWM_LEBR2_PWMLREN_Msk & (_UINT32_(value) << PWM_LEBR2_PWMLREN_Pos)) /* Assigment of value for PWMLREN in the PWM_LEBR2 register */
#define PWM_LEBR2_PWMHFEN_Pos                 _UINT32_(18)                                         /* (PWM_LEBR2) PWMH Falling Edge Enable Position */
#define PWM_LEBR2_PWMHFEN_Msk                 (_UINT32_(0x1) << PWM_LEBR2_PWMHFEN_Pos)             /* (PWM_LEBR2) PWMH Falling Edge Enable Mask */
#define PWM_LEBR2_PWMHFEN(value)              (PWM_LEBR2_PWMHFEN_Msk & (_UINT32_(value) << PWM_LEBR2_PWMHFEN_Pos)) /* Assigment of value for PWMHFEN in the PWM_LEBR2 register */
#define PWM_LEBR2_PWMHREN_Pos                 _UINT32_(19)                                         /* (PWM_LEBR2) PWMH Rising Edge Enable Position */
#define PWM_LEBR2_PWMHREN_Msk                 (_UINT32_(0x1) << PWM_LEBR2_PWMHREN_Pos)             /* (PWM_LEBR2) PWMH Rising Edge Enable Mask */
#define PWM_LEBR2_PWMHREN(value)              (PWM_LEBR2_PWMHREN_Msk & (_UINT32_(value) << PWM_LEBR2_PWMHREN_Pos)) /* Assigment of value for PWMHREN in the PWM_LEBR2 register */
#define PWM_LEBR2_Msk                         _UINT32_(0x000F007F)                                 /* (PWM_LEBR2) Register Mask  */


/* -------- PWM_CMUPD3 : (PWM Offset: 0x460) ( /W 32) PWM Channel Mode Update Register (ch_num = 3) -------- */
#define PWM_CMUPD3_CPOLUP_Pos                 _UINT32_(9)                                          /* (PWM_CMUPD3) Channel Polarity Update Position */
#define PWM_CMUPD3_CPOLUP_Msk                 (_UINT32_(0x1) << PWM_CMUPD3_CPOLUP_Pos)             /* (PWM_CMUPD3) Channel Polarity Update Mask */
#define PWM_CMUPD3_CPOLUP(value)              (PWM_CMUPD3_CPOLUP_Msk & (_UINT32_(value) << PWM_CMUPD3_CPOLUP_Pos)) /* Assigment of value for CPOLUP in the PWM_CMUPD3 register */
#define PWM_CMUPD3_CPOLINVUP_Pos              _UINT32_(13)                                         /* (PWM_CMUPD3) Channel Polarity Inversion Update Position */
#define PWM_CMUPD3_CPOLINVUP_Msk              (_UINT32_(0x1) << PWM_CMUPD3_CPOLINVUP_Pos)          /* (PWM_CMUPD3) Channel Polarity Inversion Update Mask */
#define PWM_CMUPD3_CPOLINVUP(value)           (PWM_CMUPD3_CPOLINVUP_Msk & (_UINT32_(value) << PWM_CMUPD3_CPOLINVUP_Pos)) /* Assigment of value for CPOLINVUP in the PWM_CMUPD3 register */
#define PWM_CMUPD3_Msk                        _UINT32_(0x00002200)                                 /* (PWM_CMUPD3) Register Mask  */


/** \brief PWM register offsets definitions */
#define PWM_CMR_REG_OFST               _UINT32_(0x00)      /* (PWM_CMR) PWM Channel Mode Register Offset */
#define PWM_CDTY_REG_OFST              _UINT32_(0x04)      /* (PWM_CDTY) PWM Channel Duty Cycle Register Offset */
#define PWM_CDTYUPD_REG_OFST           _UINT32_(0x08)      /* (PWM_CDTYUPD) PWM Channel Duty Cycle Update Register Offset */
#define PWM_CPRD_REG_OFST              _UINT32_(0x0C)      /* (PWM_CPRD) PWM Channel Period Register Offset */
#define PWM_CPRDUPD_REG_OFST           _UINT32_(0x10)      /* (PWM_CPRDUPD) PWM Channel Period Update Register Offset */
#define PWM_CCNT_REG_OFST              _UINT32_(0x14)      /* (PWM_CCNT) PWM Channel Counter Register Offset */
#define PWM_DT_REG_OFST                _UINT32_(0x18)      /* (PWM_DT) PWM Channel Dead Time Register Offset */
#define PWM_DTUPD_REG_OFST             _UINT32_(0x1C)      /* (PWM_DTUPD) PWM Channel Dead Time Update Register Offset */
#define PWM_CMPV_REG_OFST              _UINT32_(0x00)      /* (PWM_CMPV) PWM Comparison 0 Value Register Offset */
#define PWM_CMPVUPD_REG_OFST           _UINT32_(0x04)      /* (PWM_CMPVUPD) PWM Comparison 0 Value Update Register Offset */
#define PWM_CMPM_REG_OFST              _UINT32_(0x08)      /* (PWM_CMPM) PWM Comparison 0 Mode Register Offset */
#define PWM_CMPMUPD_REG_OFST           _UINT32_(0x0C)      /* (PWM_CMPMUPD) PWM Comparison 0 Mode Update Register Offset */
#define PWM_CLK_REG_OFST               _UINT32_(0x00)      /* (PWM_CLK) PWM Clock Register Offset */
#define PWM_ENA_REG_OFST               _UINT32_(0x04)      /* (PWM_ENA) PWM Enable Register Offset */
#define PWM_DIS_REG_OFST               _UINT32_(0x08)      /* (PWM_DIS) PWM Disable Register Offset */
#define PWM_SR_REG_OFST                _UINT32_(0x0C)      /* (PWM_SR) PWM Status Register Offset */
#define PWM_IER1_REG_OFST              _UINT32_(0x10)      /* (PWM_IER1) PWM Interrupt Enable Register 1 Offset */
#define PWM_IDR1_REG_OFST              _UINT32_(0x14)      /* (PWM_IDR1) PWM Interrupt Disable Register 1 Offset */
#define PWM_IMR1_REG_OFST              _UINT32_(0x18)      /* (PWM_IMR1) PWM Interrupt Mask Register 1 Offset */
#define PWM_ISR1_REG_OFST              _UINT32_(0x1C)      /* (PWM_ISR1) PWM Interrupt Status Register 1 Offset */
#define PWM_SCM_REG_OFST               _UINT32_(0x20)      /* (PWM_SCM) PWM Sync Channels Mode Register Offset */
#define PWM_DMAR_REG_OFST              _UINT32_(0x24)      /* (PWM_DMAR) PWM DMA Register Offset */
#define PWM_SCUC_REG_OFST              _UINT32_(0x28)      /* (PWM_SCUC) PWM Sync Channels Update Control Register Offset */
#define PWM_SCUP_REG_OFST              _UINT32_(0x2C)      /* (PWM_SCUP) PWM Sync Channels Update Period Register Offset */
#define PWM_SCUPUPD_REG_OFST           _UINT32_(0x30)      /* (PWM_SCUPUPD) PWM Sync Channels Update Period Update Register Offset */
#define PWM_IER2_REG_OFST              _UINT32_(0x34)      /* (PWM_IER2) PWM Interrupt Enable Register 2 Offset */
#define PWM_IDR2_REG_OFST              _UINT32_(0x38)      /* (PWM_IDR2) PWM Interrupt Disable Register 2 Offset */
#define PWM_IMR2_REG_OFST              _UINT32_(0x3C)      /* (PWM_IMR2) PWM Interrupt Mask Register 2 Offset */
#define PWM_ISR2_REG_OFST              _UINT32_(0x40)      /* (PWM_ISR2) PWM Interrupt Status Register 2 Offset */
#define PWM_OOV_REG_OFST               _UINT32_(0x44)      /* (PWM_OOV) PWM Output Override Value Register Offset */
#define PWM_OS_REG_OFST                _UINT32_(0x48)      /* (PWM_OS) PWM Output Selection Register Offset */
#define PWM_OSS_REG_OFST               _UINT32_(0x4C)      /* (PWM_OSS) PWM Output Selection Set Register Offset */
#define PWM_OSC_REG_OFST               _UINT32_(0x50)      /* (PWM_OSC) PWM Output Selection Clear Register Offset */
#define PWM_OSSUPD_REG_OFST            _UINT32_(0x54)      /* (PWM_OSSUPD) PWM Output Selection Set Update Register Offset */
#define PWM_OSCUPD_REG_OFST            _UINT32_(0x58)      /* (PWM_OSCUPD) PWM Output Selection Clear Update Register Offset */
#define PWM_FMR_REG_OFST               _UINT32_(0x5C)      /* (PWM_FMR) PWM Fault Mode Register Offset */
#define PWM_FSR_REG_OFST               _UINT32_(0x60)      /* (PWM_FSR) PWM Fault Status Register Offset */
#define PWM_FCR_REG_OFST               _UINT32_(0x64)      /* (PWM_FCR) PWM Fault Clear Register Offset */
#define PWM_FPV1_REG_OFST              _UINT32_(0x68)      /* (PWM_FPV1) PWM Fault Protection Value Register 1 Offset */
#define PWM_FPE_REG_OFST               _UINT32_(0x6C)      /* (PWM_FPE) PWM Fault Protection Enable Register Offset */
#define PWM_ELMR_REG_OFST              _UINT32_(0x7C)      /* (PWM_ELMR) PWM Event Line 0 Mode Register 0 Offset */
#define PWM_ELMR0_REG_OFST             _UINT32_(0x7C)      /* (PWM_ELMR0) PWM Event Line 0 Mode Register 0 Offset */
#define PWM_ELMR1_REG_OFST             _UINT32_(0x80)      /* (PWM_ELMR1) PWM Event Line 0 Mode Register 0 Offset */
#define PWM_SSPR_REG_OFST              _UINT32_(0xA0)      /* (PWM_SSPR) PWM Spread Spectrum Register Offset */
#define PWM_SSPUP_REG_OFST             _UINT32_(0xA4)      /* (PWM_SSPUP) PWM Spread Spectrum Update Register Offset */
#define PWM_SMMR_REG_OFST              _UINT32_(0xB0)      /* (PWM_SMMR) PWM Stepper Motor Mode Register Offset */
#define PWM_FPV2_REG_OFST              _UINT32_(0xC0)      /* (PWM_FPV2) PWM Fault Protection Value 2 Register Offset */
#define PWM_WPCR_REG_OFST              _UINT32_(0xE4)      /* (PWM_WPCR) PWM Write Protection Control Register Offset */
#define PWM_WPSR_REG_OFST              _UINT32_(0xE8)      /* (PWM_WPSR) PWM Write Protection Status Register Offset */
#define PWM_CMUPD0_REG_OFST            _UINT32_(0x400)     /* (PWM_CMUPD0) PWM Channel Mode Update Register (ch_num = 0) Offset */
#define PWM_CMUPD1_REG_OFST            _UINT32_(0x420)     /* (PWM_CMUPD1) PWM Channel Mode Update Register (ch_num = 1) Offset */
#define PWM_ETRG1_REG_OFST             _UINT32_(0x42C)     /* (PWM_ETRG1) PWM External Trigger Register (trg_num = 1) Offset */
#define PWM_LEBR1_REG_OFST             _UINT32_(0x430)     /* (PWM_LEBR1) PWM Leading-Edge Blanking Register (trg_num = 1) Offset */
#define PWM_CMUPD2_REG_OFST            _UINT32_(0x440)     /* (PWM_CMUPD2) PWM Channel Mode Update Register (ch_num = 2) Offset */
#define PWM_ETRG2_REG_OFST             _UINT32_(0x44C)     /* (PWM_ETRG2) PWM External Trigger Register (trg_num = 2) Offset */
#define PWM_LEBR2_REG_OFST             _UINT32_(0x450)     /* (PWM_LEBR2) PWM Leading-Edge Blanking Register (trg_num = 2) Offset */
#define PWM_CMUPD3_REG_OFST            _UINT32_(0x460)     /* (PWM_CMUPD3) PWM Channel Mode Update Register (ch_num = 3) Offset */

